
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * kubernetes_cluster_role.access_kyma_autobump_bot_github_token_trusted_workloads
  * kubernetes_cluster_role.access_kyma_autobump_bot_github_token_untrusted_workloads
  * kubernetes_cluster_role_binding.access_kyma_autobump_bot_github_token_trusted_workloads
  * kubernetes_cluster_role_binding.access_kyma_autobump_bot_github_token_untrusted_workloads
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob environment prod root module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod apply -input=false -no-color -auto-approve\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # presubmit prowjob environment prod root module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod plan -input=false -no-color\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # presubmit prowjob environment prod secrets-rotator module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod plan -input=false -no-color\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # postsubmit prowjob environment prod secrets-rotator module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_PULL_SHA apply -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod apply -input=false -no-color -auto-approve\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # presubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner plan -input=false -no-color\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # postsubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_PULL_SHA apply -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner apply -input=false -no-color -auto-approve\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # prow decoration\n      - image: \&#34;gcr.io/k8s-prow/sidecar:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/clonerefs:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/initupload:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/entrypoint:*\&#34;\n        command: []\n        args: []&#34;]
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-autobump-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n  parameters:\n    restrictedSecrets:\n      - kyma-autobump-bot-github-token\n    trustedImages:\n      # Prowjob name: post-test-infra-markdown-index-autobump\n      - image: \&#34;eu.gcr.io/kyma-project/test-infra/markdown-index:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/markdown-index\&#34;,\&#34;--config=prow/markdown-index/test-infra-markdown-index-autobump-config.yaml\&#34;,\&#34;--labels-override=kind/chore,area/documentation\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # Prowjob name: test-infra-image-detector-autobump\n      # Prowjob name: post-test-infra-image-detector-autobump\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/image-detector:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/imagedetector\&#34;,\&#34;--prow-config=prow/config.yaml\&#34;,\&#34;--prow-jobs-dir=prow/jobs\&#34;,\&#34;--terraform-dir=configs/terraform\&#34;,\&#34;--sec-scanner-config=sec-scanner-config.yaml\&#34;,\&#34;--kubernetes-dir=prow/cluster/components\&#34;,\&#34;--autobump-config=prow/image-detector/test-infra-sec-config-autobump-config.yaml\&#34;,\&#34;--inrepo-config=prow/image-detector/inrepo-config.yaml\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # Prowjob name: eventing-tools-autobump\n      - image: \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;generic-autobumper\&#34;,\&#34;--config=ci/eventing-tools-autobump-config.yaml\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # Prowjob name: ci-prow-autobump\n      - image: \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: [ ]\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;generic-autobumper\&#34;,\&#34;--config=prow/autobump-config/prow-cluster-autobump-config.yaml\&#34;,\&#34;--labels-override=kind/chore,area/prow\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # Prowjob name: ci-prow-autobump-jobs\n      - image: \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: [ ]\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;generic-autobumper\&#34;,\&#34;--config=prow/autobump-config/test-infra-autobump-config.yaml\&#34;,\&#34;--labels-override=kind/chore,area/prow\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # Prowjob name: ci-prow-label-sync\n      - image: \&#34;gcr.io/k8s-prow/label_sync:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;label_sync\&#34;,\&#34;--config=/etc/config/labels.yaml\&#34;,\&#34;--confirm=true\&#34;,\&#34;--orgs=kyma-project,kyma-incubator\&#34;,\&#34;--token=/etc/github/token\&#34;,\&#34;--endpoint=http://ghproxy\&#34;,\&#34;--endpoint=https://api.github.com\&#34;,\&#34;--debug\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob environment prod root module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod apply -input=false -no-color -auto-approve\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # presubmit prowjob environment prod root module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod plan -input=false -no-color\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # presubmit prowjob environment prod secrets-rotator module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod plan -input=false -no-color\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # postsubmit prowjob environment prod secrets-rotator module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_PULL_SHA apply -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod apply -input=false -no-color -auto-approve\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # presubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner plan -input=false -no-color\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # postsubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_PULL_SHA apply -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner apply -input=false -no-color -auto-approve\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # prow decoration\n      - image: \&#34;gcr.io/k8s-prow/sidecar:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/clonerefs:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/initupload:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/entrypoint:*\&#34;\n        command: []\n        args: []&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-autobump-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n  parameters:\n    restrictedSecrets:\n      - kyma-autobump-bot-github-token\n    trustedImages:\n      # Prowjob name: post-test-infra-markdown-index-autobump\n      - image: \&#34;eu.gcr.io/kyma-project/test-infra/markdown-index:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/markdown-index\&#34;,\&#34;--config=prow/markdown-index/test-infra-markdown-index-autobump-config.yaml\&#34;,\&#34;--labels-override=kind/chore,area/documentation\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # Prowjob name: test-infra-image-detector-autobump\n      # Prowjob name: post-test-infra-image-detector-autobump\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/image-detector:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/imagedetector\&#34;,\&#34;--prow-config=prow/config.yaml\&#34;,\&#34;--prow-jobs-dir=prow/jobs\&#34;,\&#34;--terraform-dir=configs/terraform\&#34;,\&#34;--sec-scanner-config=sec-scanner-config.yaml\&#34;,\&#34;--kubernetes-dir=prow/cluster/components\&#34;,\&#34;--autobump-config=prow/image-detector/test-infra-sec-config-autobump-config.yaml\&#34;,\&#34;--inrepo-config=prow/image-detector/inrepo-config.yaml\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # Prowjob name: eventing-tools-autobump\n      - image: \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;generic-autobumper\&#34;,\&#34;--config=ci/eventing-tools-autobump-config.yaml\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # Prowjob name: ci-prow-autobump\n      - image: \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: [ ]\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;generic-autobumper\&#34;,\&#34;--config=prow/autobump-config/prow-cluster-autobump-config.yaml\&#34;,\&#34;--labels-override=kind/chore,area/prow\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # Prowjob name: ci-prow-autobump-jobs\n      - image: \&#34;gcr.io/k8s-prow/generic-autobumper:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: [ ]\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;generic-autobumper\&#34;,\&#34;--config=prow/autobump-config/test-infra-autobump-config.yaml\&#34;,\&#34;--labels-override=kind/chore,area/prow\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # Prowjob name: ci-prow-label-sync\n      - image: \&#34;gcr.io/k8s-prow/label_sync:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;label_sync\&#34;,\&#34;--config=/etc/config/labels.yaml\&#34;,\&#34;--confirm=true\&#34;,\&#34;--orgs=kyma-project,kyma-incubator\&#34;,\&#34;--token=/etc/github/token\&#34;,\&#34;--endpoint=http://ghproxy\&#34;,\&#34;--endpoint=https://api.github.com\&#34;,\&#34;--debug\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;&#34;]
* Delete
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod apply -input=false -no-color -auto-approve\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # presubmit prowjob\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod plan -input=false -no-color\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # prow decoration\n      - image: \&#34;gcr.io/k8s-prow/sidecar:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/clonerefs:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/initupload:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/entrypoint:*\&#34;\n        command: []\n        args: []&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod apply -input=false -no-color -auto-approve\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # presubmit prowjob\n      - image: \&#34;europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\&#34;\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: &#39;^{.*\&#34;args\&#34;:[\&#34;/bin/sh\&#34;,\&#34;-c\&#34;,\&#34;/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod plan -input=false -no-color\&#34;],\&#34;container_name\&#34;:\&#34;test\&#34;,.*}$&#39;\n      # prow decoration\n      - image: \&#34;gcr.io/k8s-prow/sidecar:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/clonerefs:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/initupload:*\&#34;\n        command: []\n        args: []\n      - image: \&#34;gcr.io/k8s-prow/entrypoint:*\&#34;\n        command: []\n        args: []&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # kubernetes_cluster_role.access_kyma_autobump_bot_github_token_trusted_workloads will be created
  + resource "kubernetes_cluster_role" "access_kyma_autobump_bot_github_token_trusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-kyma-autobump-bot-github-token"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups     = [
              + "",
            ]
          + resource_names = [
              + "kyma-autobump-bot-github-token",
            ]
          + resources      = [
              + "secrets",
            ]
          + verbs          = [
              + "update",
              + "get",
              + "list",
              + "watch",
              + "patch",
              + "create",
              + "delete",
            ]
        }
    }

  # kubernetes_cluster_role.access_kyma_autobump_bot_github_token_untrusted_workloads will be created
  + resource "kubernetes_cluster_role" "access_kyma_autobump_bot_github_token_untrusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-kyma-autobump-bot-github-token"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups     = [
              + "",
            ]
          + resource_names = [
              + "kyma-autobump-bot-github-token",
            ]
          + resources      = [
              + "secrets",
            ]
          + verbs          = [
              + "update",
              + "get",
              + "list",
              + "watch",
              + "patch",
              + "create",
              + "delete",
            ]
        }
    }

  # kubernetes_cluster_role_binding.access_kyma_autobump_bot_github_token_trusted_workloads will be created
  + resource "kubernetes_cluster_role_binding" "access_kyma_autobump_bot_github_token_trusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-access-kyma-autobump-bot-github-token"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "access-kyma-autobump-bot-github-token"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "secret-manager-trusted"
          + namespace = "external-secrets"
        }
    }

  # kubernetes_cluster_role_binding.access_kyma_autobump_bot_github_token_untrusted_workloads will be created
  + resource "kubernetes_cluster_role_binding" "access_kyma_autobump_bot_github_token_untrusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-access-kyma-autobump-bot-github-token"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "access-kyma-autobump-bot-github-token"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "secret-manager-trusted"
          + namespace = "external-secrets"
        }
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod apply -input=false -no-color -auto-approve\"],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod plan -input=false -no-color\"],\"container_name\":\"test\",.*}$'\n      # prow decoration\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/clonerefs:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/initupload:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/entrypoint:*\"\n        command: []\n        args: []"] will be destroyed
  # (because key ["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod apply -input=false -no-color -auto-approve\"],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod plan -input=false -no-color\"],\"container_name\":\"test\",.*}$'\n      # prow decoration\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/clonerefs:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/initupload:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/entrypoint:*\"\n        command: []\n        args: []"] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/serviceaccounttrustedusages/terraform-executor" -> null
      - kind                    = "ServiceAccountTrustedUsage" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "c04aa3ff-007d-4a5e-a2db-37a84f905bd1" -> null
      - name                    = "terraform-executor" -> null
      - server_side_apply       = false -> null
      - uid                     = "c04aa3ff-007d-4a5e-a2db-37a84f905bd1" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: ServiceAccountTrustedUsage
            metadata:
              name: terraform-executor
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
              parameters:
                restrictedServiceAccounts:
                - terraform-executor
                trustedImages:
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod
                    apply -input=false -no-color -auto-approve"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod
                    plan -input=false -no-color"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/sidecar:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/clonerefs:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/initupload:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/entrypoint:*
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob environment prod root module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod apply -input=false -no-color -auto-approve\"],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod root module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod plan -input=false -no-color\"],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod secrets-rotator module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod plan -input=false -no-color\"],\"container_name\":\"test\",.*}$'\n      # postsubmit prowjob environment prod secrets-rotator module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_PULL_SHA apply -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod apply -input=false -no-color -auto-approve\"],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner plan -input=false -no-color\"],\"container_name\":\"test\",.*}$'\n      # postsubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_PULL_SHA apply -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner apply -input=false -no-color -auto-approve\"],\"container_name\":\"test\",.*}$'\n      # prow decoration\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/clonerefs:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/initupload:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/entrypoint:*\"\n        command: []\n        args: []"] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ServiceAccountTrustedUsage"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "terraform-executor"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: ServiceAccountTrustedUsage
            metadata:
              name: terraform-executor
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
              parameters:
                restrictedServiceAccounts:
                - terraform-executor
                trustedImages:
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod
                    apply -input=false -no-color -auto-approve"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod
                    plan -input=false -no-color"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod
                    plan -input=false -no-color"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -sha $PULL_PULL_SHA apply -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod
                    apply -input=false -no-color -auto-approve"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner
                    plan -input=false -no-color"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -sha $PULL_PULL_SHA apply -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner
                    apply -input=false -no-color -auto-approve"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/sidecar:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/clonerefs:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/initupload:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/entrypoint:*
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-autobump-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedSecrets:\n      - kyma-autobump-bot-github-token\n    trustedImages:\n      # Prowjob name: post-test-infra-markdown-index-autobump\n      - image: \"eu.gcr.io/kyma-project/test-infra/markdown-index:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/markdown-index\",\"--config=prow/markdown-index/test-infra-markdown-index-autobump-config.yaml\",\"--labels-override=kind/chore,area/documentation\"],\"container_name\":\"test\",.*}$'\n      # Prowjob name: test-infra-image-detector-autobump\n      # Prowjob name: post-test-infra-image-detector-autobump\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/image-detector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/imagedetector\",\"--prow-config=prow/config.yaml\",\"--prow-jobs-dir=prow/jobs\",\"--terraform-dir=configs/terraform\",\"--sec-scanner-config=sec-scanner-config.yaml\",\"--kubernetes-dir=prow/cluster/components\",\"--autobump-config=prow/image-detector/test-infra-sec-config-autobump-config.yaml\",\"--inrepo-config=prow/image-detector/inrepo-config.yaml\"],\"container_name\":\"test\",.*}$'\n      # Prowjob name: eventing-tools-autobump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"generic-autobumper\",\"--config=ci/eventing-tools-autobump-config.yaml\"],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-autobump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: [ ]\n        entrypoint_options: '^{.*\"args\":[\"generic-autobumper\",\"--config=prow/autobump-config/prow-cluster-autobump-config.yaml\",\"--labels-override=kind/chore,area/prow\"],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-autobump-jobs\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: [ ]\n        entrypoint_options: '^{.*\"args\":[\"generic-autobumper\",\"--config=prow/autobump-config/test-infra-autobump-config.yaml\",\"--labels-override=kind/chore,area/prow\"],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-label-sync\n      - image: \"gcr.io/k8s-prow/label_sync:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"label_sync\",\"--config=/etc/config/labels.yaml\",\"--confirm=true\",\"--orgs=kyma-project,kyma-incubator\",\"--token=/etc/github/token\",\"--endpoint=http://ghproxy\",\"--endpoint=https://api.github.com\",\"--debug\"],\"container_name\":\"test\",.*}$'"] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "SecretTrustedUsage"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kyma-autobump-bot-github-token"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: SecretTrustedUsage
            metadata:
              name: kyma-autobump-bot-github-token
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
              parameters:
                restrictedSecrets:
                - kyma-autobump-bot-github-token
                trustedImages:
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/markdown-index","--config=prow/markdown-index/test-infra-markdown-index-autobump-config.yaml","--labels-override=kind/chore,area/documentation"],"container_name":"test",.*}$
                  image: eu.gcr.io/kyma-project/test-infra/markdown-index:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/imagedetector","--prow-config=prow/config.yaml","--prow-jobs-dir=prow/jobs","--terraform-dir=configs/terraform","--sec-scanner-config=sec-scanner-config.yaml","--kubernetes-dir=prow/cluster/components","--autobump-config=prow/image-detector/test-infra-sec-config-autobump-config.yaml","--inrepo-config=prow/image-detector/inrepo-config.yaml"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/image-detector:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["generic-autobumper","--config=ci/eventing-tools-autobump-config.yaml"],"container_name":"test",.*}$
                  image: gcr.io/k8s-prow/generic-autobumper:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["generic-autobumper","--config=prow/autobump-config/prow-cluster-autobump-config.yaml","--labels-override=kind/chore,area/prow"],"container_name":"test",.*}$
                  image: gcr.io/k8s-prow/generic-autobumper:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["generic-autobumper","--config=prow/autobump-config/test-infra-autobump-config.yaml","--labels-override=kind/chore,area/prow"],"container_name":"test",.*}$
                  image: gcr.io/k8s-prow/generic-autobumper:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["label_sync","--config=/etc/config/labels.yaml","--confirm=true","--orgs=kyma-project,kyma-incubator","--token=/etc/github/token","--endpoint=http://ghproxy","--endpoint=https://api.github.com","--debug"],"container_name":"test",.*}$
                  image: gcr.io/k8s-prow/label_sync:*
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod apply -input=false -no-color -auto-approve\"],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod plan -input=false -no-color\"],\"container_name\":\"test\",.*}$'\n      # prow decoration\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/clonerefs:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/initupload:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/entrypoint:*\"\n        command: []\n        args: []"] will be destroyed
  # (because key ["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod apply -input=false -no-color -auto-approve\"],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod plan -input=false -no-color\"],\"container_name\":\"test\",.*}$'\n      # prow decoration\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/clonerefs:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/initupload:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/entrypoint:*\"\n        command: []\n        args: []"] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/serviceaccounttrustedusages/terraform-executor" -> null
      - kind                    = "ServiceAccountTrustedUsage" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "4a47656c-fd19-4959-8625-50b33797e1c4" -> null
      - name                    = "terraform-executor" -> null
      - server_side_apply       = false -> null
      - uid                     = "4a47656c-fd19-4959-8625-50b33797e1c4" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: ServiceAccountTrustedUsage
            metadata:
              name: terraform-executor
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
              parameters:
                restrictedServiceAccounts:
                - terraform-executor
                trustedImages:
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod
                    apply -input=false -no-color -auto-approve"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod
                    plan -input=false -no-color"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/sidecar:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/clonerefs:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/initupload:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/entrypoint:*
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob environment prod root module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod apply -input=false -no-color -auto-approve\"],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod root module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod plan -input=false -no-color\"],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod secrets-rotator module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod plan -input=false -no-color\"],\"container_name\":\"test\",.*}$'\n      # postsubmit prowjob environment prod secrets-rotator module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_PULL_SHA apply -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod apply -input=false -no-color -auto-approve\"],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner plan -input=false -no-color\"],\"container_name\":\"test\",.*}$'\n      # postsubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/bin/sh\",\"-c\",\"/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner init -input=false \\u0026\\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME -sha $PULL_PULL_SHA apply -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner apply -input=false -no-color -auto-approve\"],\"container_name\":\"test\",.*}$'\n      # prow decoration\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/clonerefs:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/initupload:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/entrypoint:*\"\n        command: []\n        args: []"] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ServiceAccountTrustedUsage"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "terraform-executor"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: ServiceAccountTrustedUsage
            metadata:
              name: terraform-executor
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
              parameters:
                restrictedServiceAccounts:
                - terraform-executor
                trustedImages:
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -sha $PULL_BASE_SHA apply -- terraform -chdir=./configs/terraform/environments/prod
                    apply -input=false -no-color -auto-approve"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/environments/prod
                    plan -input=false -no-color"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod
                    plan -input=false -no-color"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./development/secrets-rotator/terraform/environments/prod
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -sha $PULL_PULL_SHA apply -- terraform -chdir=./development/secrets-rotator/terraform/environments/prod
                    apply -input=false -no-color -auto-approve"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -pr $PULL_NUMBER -sha $PULL_PULL_SHA plan -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner
                    plan -input=false -no-color"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/bin/sh","-c","/bin/terraform -chdir=./configs/terraform/secrets-leaks-log-scanner
                    init -input=false \u0026\u0026 /tfcmt/tfcmt -owner $REPO_OWNER -repo $REPO_NAME
                    -sha $PULL_PULL_SHA apply -- terraform -chdir=./configs/terraform/secrets-leaks-log-scanner
                    apply -input=false -no-color -auto-approve"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/sidecar:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/clonerefs:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/initupload:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/entrypoint:*
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-autobump-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedSecrets:\n      - kyma-autobump-bot-github-token\n    trustedImages:\n      # Prowjob name: post-test-infra-markdown-index-autobump\n      - image: \"eu.gcr.io/kyma-project/test-infra/markdown-index:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/markdown-index\",\"--config=prow/markdown-index/test-infra-markdown-index-autobump-config.yaml\",\"--labels-override=kind/chore,area/documentation\"],\"container_name\":\"test\",.*}$'\n      # Prowjob name: test-infra-image-detector-autobump\n      # Prowjob name: post-test-infra-image-detector-autobump\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/image-detector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"/imagedetector\",\"--prow-config=prow/config.yaml\",\"--prow-jobs-dir=prow/jobs\",\"--terraform-dir=configs/terraform\",\"--sec-scanner-config=sec-scanner-config.yaml\",\"--kubernetes-dir=prow/cluster/components\",\"--autobump-config=prow/image-detector/test-infra-sec-config-autobump-config.yaml\",\"--inrepo-config=prow/image-detector/inrepo-config.yaml\"],\"container_name\":\"test\",.*}$'\n      # Prowjob name: eventing-tools-autobump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"generic-autobumper\",\"--config=ci/eventing-tools-autobump-config.yaml\"],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-autobump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: [ ]\n        entrypoint_options: '^{.*\"args\":[\"generic-autobumper\",\"--config=prow/autobump-config/prow-cluster-autobump-config.yaml\",\"--labels-override=kind/chore,area/prow\"],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-autobump-jobs\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: [ ]\n        entrypoint_options: '^{.*\"args\":[\"generic-autobumper\",\"--config=prow/autobump-config/test-infra-autobump-config.yaml\",\"--labels-override=kind/chore,area/prow\"],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-label-sync\n      - image: \"gcr.io/k8s-prow/label_sync:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":[\"label_sync\",\"--config=/etc/config/labels.yaml\",\"--confirm=true\",\"--orgs=kyma-project,kyma-incubator\",\"--token=/etc/github/token\",\"--endpoint=http://ghproxy\",\"--endpoint=https://api.github.com\",\"--debug\"],\"container_name\":\"test\",.*}$'"] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "SecretTrustedUsage"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kyma-autobump-bot-github-token"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: SecretTrustedUsage
            metadata:
              name: kyma-autobump-bot-github-token
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
              parameters:
                restrictedSecrets:
                - kyma-autobump-bot-github-token
                trustedImages:
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/markdown-index","--config=prow/markdown-index/test-infra-markdown-index-autobump-config.yaml","--labels-override=kind/chore,area/documentation"],"container_name":"test",.*}$
                  image: eu.gcr.io/kyma-project/test-infra/markdown-index:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["/imagedetector","--prow-config=prow/config.yaml","--prow-jobs-dir=prow/jobs","--terraform-dir=configs/terraform","--sec-scanner-config=sec-scanner-config.yaml","--kubernetes-dir=prow/cluster/components","--autobump-config=prow/image-detector/test-infra-sec-config-autobump-config.yaml","--inrepo-config=prow/image-detector/inrepo-config.yaml"],"container_name":"test",.*}$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/image-detector:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["generic-autobumper","--config=ci/eventing-tools-autobump-config.yaml"],"container_name":"test",.*}$
                  image: gcr.io/k8s-prow/generic-autobumper:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["generic-autobumper","--config=prow/autobump-config/prow-cluster-autobump-config.yaml","--labels-override=kind/chore,area/prow"],"container_name":"test",.*}$
                  image: gcr.io/k8s-prow/generic-autobumper:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["generic-autobumper","--config=prow/autobump-config/test-infra-autobump-config.yaml","--labels-override=kind/chore,area/prow"],"container_name":"test",.*}$
                  image: gcr.io/k8s-prow/generic-autobumper:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^{.*"args":["label_sync","--config=/etc/config/labels.yaml","--confirm=true","--orgs=kyma-project,kyma-incubator","--token=/etc/github/token","--endpoint=http://ghproxy","--endpoint=https://api.github.com","--debug"],"container_name":"test",.*}$
                  image: gcr.io/k8s-prow/label_sync:*
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 8 to add, 0 to change, 2 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 35, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  35: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```



<!-- github-comment: {"Command":"plan","PRNumber":8012,"Program":"tfcmt","SHA1":"c3eddf78a705c00ef3bd0f9ee78d105098365ac6","Vars":{}} -->